Repository: pilipandr770/work.site.
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: de, ru

source: Магазин товарів
de: Digitales Warengeschäft
ru: Магазин товаров

source: Перейти до оплати
de: Zur Zahlung
ru: Перейти к оплате

source: Контакти
de: Kontakte
ru: Контакты

source: Тут будуть контактні дані.
de: Hier werden Kontaktdaten angezeigt.
ru: Здесь будут контактные данные.

source: Імпресум
de: Impressum
ru: Импрессум

source: Тут буде інформація про компанію.
de: Hier werden Unternehmensinformationen angezeigt.
ru: Здесь будет информация о компании.

source: Головна
de: Startseite
ru: Главная

source: Оплата онлайн
de: Online-Zahlung
ru: Онлайн-оплата

source: Виберіть зручний спосіб оплати для вашого замовлення. Ми підтримуємо Stripe, PayPal, банківські перекази та інші сучасні методи.
de: Wählen Sie eine bequeme Zahlungsmethode für Ihre Bestellung. Wir unterstützen Stripe, PayPal, Banküberweisungen und andere moderne Methoden.
ru: Выберите удобный способ оплаты для вашего заказа. Мы поддерживаем Stripe, PayPal, банковские переводы и другие современные методы.

source: Оплатити через Stripe
de: Mit Stripe bezahlen
ru: Оплатить через Stripe

source: Оплатити через PayPal
de: Mit PayPal bezahlen
ru: Оплатить через PayPal

source: Реквізити
de: Bankverbindung
ru: Реквизиты

source: Завантажити рахунок PDF
de: Rechnung als PDF herunterladen
ru: Скачать счет PDF

source: Вхід в адмінку
de: Admin-Login
ru: Вход в админку

source: Вхід
de: Login
ru: Вход

source: Увійти
de: Anmelden
ru: Войти

source: Політика конфіденційності
de: Datenschutzrichtlinie
ru: Политика конфиденциальности

source: Ми поважаємо вашу приватність і дотримуємося вимог Загального регламенту захисту даних (GDPR) та інших законів ЄС щодо захисту персональних даних.
de: Wir respektieren Ihre Privatsphäre und halten uns an die Datenschutz-Grundverordnung (DSGVO) і інші EU-Datenschutzgesetze.
ru: Мы уважаем вашу приватность и соблюдаем требования Общего регламента по защите данных (GDPR) и других законов ЕС о защите персональных данных.

source: Які дані ми збираємо?
de: Welche Daten sammeln wir?
ru: Какие данные мы собираем?

source: Ми не збираємо жодних персональних даних автоматично.
de: Wir sammeln keine personenbezogenen Daten автоматично.
ru: Мы не собираем никаких персональных данных автоматически.

source: Ми отримуємо ваші контактні дані (ім'я, email, телефон) лише якщо ви самостійно залишаєте їх для зв'язку або оформлення заявки/оплати.
de: Wir erhalten Ihre Kontaktdaten (Name, E-Mail, Telefon) nur, якщо ви самостійно залишаєте їх для зв'язку або оформлення заявки/оплати.
ru: Мы получаем ваши контактные данные (имя, email, телефон) только если вы самостоятельно оставляете их для связи или оформления заявки/оплаты.

source: Як ми використовуємо ваші дані?
de: Wie verwenden wir Ihre Daten?
ru: Как мы используем ваши данные?

source: Ваші дані використовуються виключно для зв'язку з вами або для виконання вашого запиту (наприклад, для зворотного зв'язку чи виставлення рахунку).
de: Ihre Daten werden ausschließlich zur Kontaktaufnahme з вами або для виконання вашого запиту (наприклад, для зворотного зв'язку чи виставлення рахунку).
ru: Ваши данные используются исключительно для связи с вами или для выполнения вашего запроса (например, для обратной связи или выставления счета).

source: Ми не передаємо ваші дані третім особам, окрім випадків, коли це прямо вимагається законом.
ru: Мы не передаем ваши данные третьим лицам, кроме случаев, когда это прямо требуется законом.

source: Реклама та сторонні сервіси
de: Werbung und Drittanbieter-Dienste
ru: Реклама и сторонние сервисы

source: На сайті можуть бути інтегровані сторонні сервіси (наприклад, Facebook, Google), які можуть збирати дані про вас відповідно до своїх політик конфіденційності.
ru: На сайте могут быть интегрированы сторонние сервисы (например, Facebook, Google), которые могут собирать данные о вас согласно своим политикам конфиденциальности.

source: Ми не маємо доступу до цих даних і не контролюємо їх збір.
ru: Мы не имеем доступа к этим данным и не контролируем их сбор.

source: Детальніше про політику конфіденційності Facebook:
de: Mehr zur Datenschutzrichtlinie von Facebook:
ru: Подробнее о политике конфиденциальности Facebook:

source: Детальніше про політику конфіденційності Google:
de: Mehr zur Datenschutzrichtlinie von Google:
ru: Подробнее о политике конфиденциальности Google:

source: Ваші права
de: Ihre Rechte
ru: Ваши права

source: Ви маєте право отримати інформацію про свої персональні дані, які ми зберігаємо (якщо такі є), вимагати їх виправлення або видалення.
de: Sie haben das право, Auskunft про свої персональні дані, які ми зберігаємо (якщо такі є), вимагати їх виправлення або видалення.
ru: Вы имеете право получить информацию о своих персональных данных, которые мы храним (если таковые есть), требовать их исправления или удаления.

source: Для цього напишіть нам на
de: Schreiben Sie uns dazu an
ru: Для этого напишите нам на

source: Зміни до політики
de: Änderungen der Richtlinie
ru: Изменения в политике

source: Ми можемо періодично оновлювати цю політику. Актуальна версія завжди доступна на цій сторінці.
de: Wir можемо періодично оновлювати цю політику. Актуальна версія завжди доступна на цій сторінці.
ru: Мы можем периодически обновлять эту политику. Актуальная версия всегда доступна на этой странице.

source: Використовуючи наш сайт, ви погоджуєтесь із цією політикою конфіденційності.
de: Durch die Nutzung unserer Website stimmen Sie dieser Datenschutzrichtlinie zu.
ru: Используя наш сайт, вы соглашаетесь с этой политикой конфиденциальности.

source: Адмінка
de: Adminbereich
ru: Админка

source: Адмін-панель
de: Admin-Panel
ru: Админ-панель

source: Блоки сайту
de: Seitenblöcke
ru: Блоки сайта

source: Способи оплати
de: Zahlungsmethoden
ru: Способы оплаты

source: Історія оплат
de: Zahlungshistorie
ru: История оплат

source: Налаштування соцмереж
de: Soziale Einstellungen
ru: Настройки соцсетей

source: Вийти
de: Abmelden
ru: Выйти

source: Останні оплати
de: Letzte Zahlungen
ru: Последние оплаты

source: Налаштування сайту
de: Seiteneinstellungen
ru: Настройки сайта

source: Налаштування соцмереж і email
de: Einstellungen für soziale Netzwerke і E-Mail
ru: Настройки соцсетей и email

source: Зберегти
de: Speichern
ru: Сохранить

source: Сторінку не знайдено
de: Seite не знайдено
ru: Страница не найдена

source: Не знайдено
ru: Не найдено

source: На головну
de: Zur Startseite
ru: На главную

source: Помилка сервера
de: Serverfehler
ru: Ошибка сервера

source: Внутрішня помилка
de: Interner Fehler
ru: Внутренняя ошибка

source: Оплата
de: Zahlung
